In [2]:
import pandas as pd
D=pd.read_csv("Sheet.csv")

In [3]:
D

   Name Class  Marks
0     A    2A     90
1     B    2A     93
2     C    2B     83
3    D1    2E     79
4     E    2C     93
5     F    2D     85
6    HG    2C     85
7    SG    2A     95
8    FS    2D     85
9    SS    2F     95
10   FG    2C     97
11   BB    2A     97
12   fw    2C     83
13   rw    2A     74

In [4]:
D["Name"]

0      A
1      B
2      C
3     D1
4      E
5      F
6     HG
7     SG
8     FS
9     SS
10    FG
11    BB
12    fw
13    rw
Name: Name, dtype: object

In [5]:
D["Marks"].max()

97

In [6]:
D["Marks"].mean()

88.14285714285714

In [7]:
D.head()

  Name Class  Marks
0    A    2A     90
1    B    2A     93
2    C    2B     83
3   D1    2E     79
4    E    2C     93

In [8]:
D.tail()

   Name Class  Marks
9    SS    2F     95
10   FG    2C     97
11   BB    2A     97
12   fw    2C     83
13   rw    2A     74

In [9]:
D["Marks"]>90

0     False
1      True
2     False
3     False
4      True
5     False
6     False
7      True
8     False
9      True
10     True
11     True
12    False
13    False
Name: Marks, dtype: bool

In [10]:
D.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    14 non-null     object
 1   Class   14 non-null     object
 2   Marks   14 non-null     int64
dtypes: int64(1), object(2)
memory usage: 464.0+ bytes

In [11]:
D[["Name","Class"]]

   Name Class
0     A    2A
1     B    2A
2     C    2B
3    D1    2E
4     E    2C
5     F    2D
6    HG    2C
7    SG    2A
8    FS    2D
9    SS    2F
10   FG    2C
11   BB    2A
12   fw    2C
13   rw    2A

In [12]:
D.head(4)

  Name Class  Marks
0    A    2A     90
1    B    2A     93
2    C    2B     83
3   D1    2E     79

In [13]:
D.head(4).min()

Name      A
Class    2A
Marks    79
dtype: object

In [14]:
D[D["Marks"]>90]

   Name Class  Marks
1     B    2A     93
4     E    2C     93
7    SG    2A     95
9    SS    2F     95
10   FG    2C     97
11   BB    2A     97

In [15]:
D.describe()

           Marks
count  14.000000
mean   88.142857
std     7.166773
min    74.000000
25%    83.500000
50%    87.500000
75%    94.500000
max    97.000000

In [16]:
type(D)

pandas.core.frame.DataFrame

In [17]:
D.head(4).tail(1)

  Name Class  Marks
3   D1    2E     79

In [18]:
a=pd.Series([11,23,53,632],index=["Afa","afa",3,"24"])
print(a)

Afa     11
afa     23
3       53
24     632
dtype: int64

In [21]:
#Adding new coloum
D["Grade"]=["A","C","D","A","C","D","A","C","D","A","C","D","A","C"]
D

   Name Class  Marks Grade
0     A    2A     90     A
1     B    2A     93     C
2     C    2B     83     D
3    D1    2E     79     A
4     E    2C     93     C
5     F    2D     85     D
6    HG    2C     85     A
7    SG    2A     95     C
8    FS    2D     85     D
9    SS    2F     95     A
10   FG    2C     97     C
11   BB    2A     97     D
12   fw    2C     83     A
13   rw    2A     74     C

In [ ]:
#TO display particular index and their values df.loc["row","coloumn"(optional)]
#objet1=object.to_Excel("filename.csv",sheetname="s")